# ==========
#  ЗАДАЧА №1
#  Создай переменные и выведи их в одну строку
#  ===========
# name = 'Mikhail'
# age = 41
# height = 170
# is_student = 'Студент'
# print(name, age, height, is_student, sep=' ==>>> ')
#
#  Задача №2
#  Создай две переменные и выведи их сумму, разность, произведение и деление
# a = 70
# b = 7
# print(a+b, a-b, a*b, a/b)
#
#  Задача 3
#  x = "100"
#  y = "3.5"
#  Преобразуй их в числа и выведи `x + 50` и `y * 2
# x = "100"
# y = "3.5"
# print('x = ',x)
# print('y = ',y)
# print('x + 50 = ', int(x) +50)
# print('y * 2 = ', float(y) * 2)
#
# **Задача 2.1**
# Попроси пользователя ввести имя и возраст.
#  Выведи: `Привет, <имя>! Тебе <возраст> лет.`
# name = input('Введите ваше имя: ')
# age = input('Введите ваш возраст: ')
# print(f'Привет', name,'! Тебе', age, 'лет')
#
# **Задача 2.2**
# Попроси ввести 2 числа.
#  Выведи их сумму.
# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# print('Сумма чисел: ',a+b)
#
#  **Задача 2.3**
#  Попроси ввести число и выведи его квадрат.
# a = int(input('Введи число: '))
# print('Квадрат это числа: ', a**2)
#
# **Задача 2.4**
# Попроси ввести цену товара и количество.
# Выведи итоговую стоимость.
#
#a = int(input('Введи стоимость товара: '))
#b = int(input('Введи количество товара: '))
#print('Итоговая стоимость: ', a*b)
#
#** Задача 3.1 **
#Дано число `n`.Выведи:
# # `n // 10`
# # n % 10`
# n = int(input('введите число n: '))
# print(n)
# print('Делим n на 10 (целая часть): ', n//10)
# print('Остаток от деления на 10: ', n%10)
#
# # **Задача 3.2**
# # Пользователь вводит 2 числа.
# # Выведи результат деления с округлением до 2 знаков через f-string.
# a = int(input('введите первое число: '))
# b = int(input('Введите второе число: '))
# print(f'Деление с округлением: {a/b:.2f}')
#
# Пользователь вводит длину и ширину прямоугольника.
# Выведи площадь и периметр.
a=int(input('Введите длину: '))
b=int(input('Введите ширину: '))
print('Площадь прямоугольник:', a*b)
print('Периметр треугольника: ', 2*(a + b))