# Пользователь вводит число.
# Выведи: положительное / отрицательное / ноль.
# number = int(input('Введите число: '))
# if number==0:
#     print("ноль")
# elif number < 0:
#     print('отрицательное')
# elif number > 0:
#     print('положительное')
#
# **Задача 4.2**
# Пользователь вводит число.
# Выведи: четное или нечетное.
# n = int(input('Введите число: '))
# if n % 2 == 0:
#     print('Это четное число', n)
# else:
#     print('Вы ввели нечетно число', n)

# **Задача 4.3**
# Пользователь вводит возраст.
# Если возраст < 18 → “Доступ запрещён”, иначе “Доступ разрешён”.
# age = int(input('Введите ваш возраст: '))
# if age <18:
#     print('Доступ запрещен')
# else:
#     print('Доступ разрешен')

# **Задача 4.4**
# Пользователь вводит оценку (0–100).
# Выведи оценку буквами:
# - 90–100 → A
# - 80–89 → B
# - 70–79 → C
# - 60–69 → D
# - иначе → F
# s = int(input('введите оенку от 0 до 100: '))
# if s > 59 and s < 70:
#     print('Оценка D')
# elif s > 69 and s < 80:
#     print('Оценка C')
# elif s > 79 and s < 90:
#     print('Оценка B')
# elif s > 89 and s < 101:
#     print('Оценка A')
# elif s > 0 and s < 60:
#     print('Оценка F')
# else:
#     print('Такая оценка недопустима')
#
# **Задача 5.1**
# Пользователь вводит логин и пароль.
# Если логин = `admin` и пароль = `1234`, вывести “Вход выполнен”, иначе “Ошибка”.
# login = input('Введите логин: ')
# password = input('Введите пароль: ')
# if login == 'admin' and password == '1234':
#     print('Вход выполнен')
# else:
#     print('Ошибка')
#
# **Задача 5.2**
# Пользователь вводит сумму покупки.
# Если сумма:
# - < 10000 → скидка 0%
# - 10000–19999 → 5%
# - 20000–49999 → 10%
# - > = 50000 → 15%
#     > Выведи итоговую цену.

# cost = int(input('введите сумму покупки: '))
# if cost < 10000:
#     skidka = 0
# elif cost >= 10000 and cost <= 19000:
#     skidka = 5
# elif cost >= 20000 and cost <= 49000:
#     skidka = 10
# elif cost >= 50000:
#     skidka = 15

# itog_skidka = cost * skidka / 100
# print('Скидка с покупки', itog_skidka)
# print('Итоговая сумма: ', cost - itog_skidka)

# **Задача 5.3 (сложнее)**
# Пользователь вводит 3 числа.
# Определи и выведи:
# - все ли числа равны
# - есть ли хотя бы два равных
# - или все разные
# a = int(input("Первое число: "))
# b = int(input("Второе число: "))
# c = int(input("Третье число: "))
# print(a, b, c)
# if a == b == c:
#     print("Все числа равны")
# elif a==b and a!=c or a==c and b!=c or b==c and a!=c: # elif a == b or a == c or b == c:
#     print('Два числа равны')
# else:
#     print("Все числа разные")
#
# **Задача 6.1**
# Выведи числа от 1 до 10.
# n = int(input('введи число от 1 до 10: '))
for i in range(1, 11):
    print(str(i))




