# Задача 1: «Умножитель»
# Создайте лямбда-функцию, которая принимает два числа и возвращает их произведение.

multiply = lambda a, b: a * b  # лямбда-функция принимает два числа и возвращает их произведение

print("Задача 1")
print("Результат:", multiply(5, 4))  # вызываем функцию и выводим результат
print()


# Задача 2: «Склеивание строк»
# Напишите лямбда-функцию, которая принимает имя и фамилию,
# а возвращает строку в формате "Фамилия Имя".

full_name = lambda name, surname: f"{surname} {name}"  # лямбда объединяет фамилию и имя в нужном порядке

print("Задача 2")
print("Результат:", full_name("Алихан", "Исмагулов"))  # вывод результата работы функции
print()


# Задача 3: «Проверка на четность»
# Создайте лямбда-функцию, которая возвращает True, если число четное, и False, если нет.

is_even = lambda x: x % 2 == 0  # проверяем делится ли число на 2 без остатка

print("Задача 3")
print("7 четное?", is_even(7))  # проверяем число 7
print()


# Задача 4: «Сортировка по последней букве»
# Дан список слов.
# Используйте функцию sorted() и лямбду в качестве ключа,
# чтобы отсортировать слова по их последней букве.

words = ["яблоко", "арбуз", "банан", "киви"]  # исходный список слов

sorted_words = sorted(words, key=lambda word: word[-1])  # сортируем слова по последнему символу

print("Задача 4")
print("Отсортированные слова:", sorted_words)  # вывод результата сортировки
print()


# Задача 5: «Перевод в градусы Цельсия»
# Дан список температур в Фаренгейте.
# С помощью map и лямбды переведите их в Цельсий по формуле.

fahrenheits = [32.0, 50.0, 68.0, 86.0]  # список температур в Фаренгейтах

celsius = list(map(lambda f: int((f - 32) * 5 / 9), fahrenheits))  # переводим температуры в Цельсий

print("Задача 5")
print("Температуры в Цельсиях:", celsius)  # вывод результата
print()


# Задача 6: «Длина каждого слова»
# Дан список слов.
# Используйте map, чтобы получить список их длин.

words = ["Python", "is", "awesome"]  # список слов

lengths = list(map(lambda word: len(word), words))  # получаем длину каждого слова

print("Задача 6")
print("Длины слов:", lengths)  # вывод результата
print()


# Задача 7: «Числа в строки»
# Дан список чисел.
# Превратите их в список строк.

numbers = [1, 2, 3, 4, 5]  # список чисел

strings = list(map(lambda x: str(x), numbers))  # преобразуем каждое число в строку

print("Задача 7")
print("Список строк:", strings)  # вывод результата
print()


# Задача 8: «Обработка словаря цен»
# Дан список цен в тенге.
# С помощью map создайте новый список строк,
# где к каждой цене добавлен знак валюты и текст "цена: ".

prices = [1000, 2500, 5000]  # список цен

formatted_prices = list(map(lambda p: f"цена: {p} тг", prices))  # создаем строки с текстом и валютой

print("Задача 8")
print("Форматированные цены:", formatted_prices)  # вывод результата