# Задача 1: «Безопасное сложение»
# Условие: Напишите программу, которая запрашивает у пользователя два числа и выводит их сумму.
# Если пользователь ввел текст вместо числа, программа должна вывести: «Ошибка: вводите только цифры!».
# while True:
#     try:
#         num_1 = int(input('Введите первое число: '))
#         num_2 = int(input('Введите второе число: '))
#         result = num_1 + num_2
#         print(result)
#     except ValueError:
#         print('Ошибка: вводите только целое число!')

# Задача 2: «Достать из списка»
# Условие: Дан список colors = ["red", "green", "blue"].
# Запросите у пользователя индекс (число) и выведите цвет под этим номером.
# Обработайте ошибку выхода за границы списка.


while True:
    try:
        colors = ["red", "green", "blue"]
        color_user = int(input('Введите индекс от 0 до 2: '))
        print(colors[color_user])
    except IndexError:
        print('Введен не правильный индекс')
    except ValueError:
        print('Введите целым числом индекс от 0 до 2: ')
