# Задача 1: «Умный калькулятор процентов»
# Условие: Напишите программу, которая запрашивает общую сумму счета и процент чаевых.
# Программа должна вывести итоговую сумму.
# Что нужно сделать: Пользователь может ввести текст вместо цифр или попытаться оставить "нулевой" или "отрицательный" счет.
# Программа не должна «падать».
# Пример вывода: Ошибка: вводите только положительные числа.

# try:
#     bill = float(input('Введите общую сумму счета: '))
#     proc = float(input('Введите процент чаевых: '))
#     if bill <= 0 or proc <= 0:
#        raise ValueError('Ошибка. Вводите только положительные числа')
#     chek = bill + (bill*proc/100)
#     print('Общая сумма', chek)
#
# except ValueError as e:
#     print(f' {e} Исправьте ошибку. водите только положительные числа')
#
#
# «Среднее арифметическое цен»
# Условие: Пользователь вводит цены товаров через пробел.
# Программа должна посчитать их среднее значение.
# Что нужно сделать: Если пользователь нажал Enter, не введя ничего,
# или ввел буквы, программа должна это обработать.
# Пример вывода: Ошибка: список цен пуст или содержит ошибки.

# try:
#     price = input('Укажите цену: ').split()
#     price = list(map(int, price))
#     price_2 = sum(price) / len(price)
#     print('Средняя цена ' + str(price_2))
# except ZeroDivisionError as e:
#     print('Пусто. Вводите целые числа')
# except ValueError as e:
#     print('Ошибка. Используйте только целые числа')

# «Мини-банкомат»
# Условие: На счету 5000 тенге. Пользователь вводит сумму для снятия.
# Что нужно сделать: Предусмотреть: ввод текста, снятие суммы больше остатка, снятие отрицательной суммы.
# Пример вывода: Недостаточно средств. или Сумма должна быть положительной.


