# Исходные данные: список кортежей
print()
work_log = [
    ("Дмитрий", [8, 9, 8, 7, 8]),
    ("Ольга", [10, 10, 9, 11, 10]),
    ("Игорь", [4, 5, 0, 6, 4]),
    ("Елена", [8, 8, 8, 8, 8])
]
print('Сотрудники и часы: ', work_log)
print()
# 1. Поиск "передовика" (максимум часов за неделю)

max_hours = 0  # Здесь будем хранить максимум часов
best = ""  # Имя передовика

for name, hours in work_log:  # Проходим по каждому сотруднику
    total_hours = sum(hours)  # Считаем общее количество часов за неделю
    if total_hours > max_hours:  # Если больше текущего максимума
        max_hours = total_hours  # Обновляем максимум
        best = name  # Запоминаем имя сотрудника

print("Передовик недели:", best, "-", max_hours, "часов")

# 2. Поиск сотрудника с прогулом

for name, hours in work_log:  # Перебираем всех сотрудников
    if 0 in hours:  # Проверяем, есть ли 0 часов
        print("Сотрудники с прогулом: ", name)

# 3. Среднее количество часов в день

print("\nСреднее количество часов в день:")

for name, hours in work_log:  # Проходим по каждому сотруднику
    average_hours = sum(hours) / len(hours)  # Среднее значение
    print(f"- {name}: {average_hours:.2f} часа")
