group = ['Михаил', 'Молдир', 'Аскар', 'Али']
print(group [1])

# ===================================================
# Оператор        Операция                                            Пример          Результат
# ===================================================
# **              Возведение в степень                                2**3            8
# %               Деление по модулю/остаток                           22 % 8          6
# //              Целочисленное деление с отбрасыванием дробной части 22 // 8         2
# /               Деление                                             22 / 8          2.75
# *               Умножение                                           3 * 5           15
# -               Вычитание                                           5-2             3
# +               Сложение                                            2 + 2           4

# int использует целочисленные значения 0, 1, 2, -3, -2
# float использует вещественные значения (плавающая запятая) 0.1, 5.63, -0.5
