# Задача 10: Инструментальный модуль с самопроверкой (_name_)
# Суть: Отработка самого важного концепта - разделения кода, который должен работать только при тестах, и кода для импорта.
# Что сделать:
# Создай модуль math_tools.py.
# Напиши в нем функцию get_factorial(n).
# Добавь блок if _name_ == "_main_":. Внутри него напиши код, который проверяет работу функции (например, вычисляет факториал 5).
# В файле main.py импортируй модуль и вызови функцию для числа 6.
# Убедись, что при запуске main.py тест для числа 5 не выполняется.

from math_tools import get_factorial

print(get_factorial(3))