# Задача 1: «Приветствие гостя»
# Создайте глобальную переменную username = "Алихан". Напишите
# функцию greet(), которая просто печатает фразу «Добро пожаловать, » и
# добавляет значение глобальной переменной. Вызовите функцию.
# username = 'Алихан'
# def greet():
#     print('Добро пожаловать', username, '!')
# greet()

# Задача 2: «Личный кабинет»
# Создайте функцию show_status(). Внутри неё объявите локальную переменную status = "В сети".
# Выведите её на экран внутри функции. Попробуйте вывести её же вне функции и убедитесь, что возникает
# ошибка.
# def show_status():
#     status = 'В сети'
#     print(status)
# show_status()
#print(status) # должен вывести ошибку

# Задача 3: «Смена города»
# Создайте глобальную переменную city = "Алматы". Напишите функцию
# travel(), внутри которой создайте локальную переменную city = "Астана".
# Выведите city внутри функции и после её вызова. Убедитесь, что
# глобальная переменная не изменилась.
# city = 'Алматы'
# def travel():
#     city = 'Астана'
#     print('Локальная переменная: ', city)
# travel()
# print('Глобальная переменная: ', city)

# Задача 4: «Счетчик кликов»
# Создайте глобальную переменную clicks = 0 Напишите функцию click(),
# которая при каждом вызове увеличивает значение глобальной переменной
# на 1 Вызовите функцию 3 раза и выведите итоговое значение clicks.
# clicks = 0
# def click():
#     global clicks
#     clicks += 1
#     # print(clicks) # избыточно. можно убрать
# click()
# click()
# click()
# print(clicks)

# Задача 5: «Магическое число»
# Создайте функцию generate_number(). Внутри неё создайте локальную
# переменную n = 7 Напишите вторую функцию show_number(), которая
# также создает локальную переменную n = 10 Вызовите обе функции.
# Проверьте, мешают ли локальные переменные друг другу.
# def generate_number():
#     n = 7
#     print(n)
# def show_number():
#     n = 10
#     print(n)
# generate_number()
# show_number()

# Задача 6: «Банкомат»
# Создайте глобальную переменную balance = 5000 Напишите две функции:
# withdraw() (снимает 1000 с баланса через global) и deposit() (добавляет
# 2000 к балансу через global). Вызовите их по очереди и выведите остаток.
# balance = 5000
# print('Начальная сумма: ', balance)
# def withdraw():
#     global balance
#     balance -=1000
#     print('Остаток после списания', balance)
# def deposit():
#     global balance
#     balance += 3000
#     print('Остаток после пополнения', balance)
# def deposit_2():
#     global balance
#     balance += 5000
#
# withdraw()
# deposit()
# deposit_2()
# print('Итог: ', balance)
#
# Задача 7: «Умный свет»
# Создайте глобальную переменную is_light_on = False. Напишите функцию
# switch(), которая меняет значение на противоположное (если было False,
# станет True, и наоборот). Вызовите функцию дважды, чтобы «включить» и «выключить» свет.
# is_light_on = False
# def switch():
#     global is_light_on
#     if is_light_on:
#         is_light_on = False
#         print('Выключено')
#     else:
#         is_light_on = True
#         print('Включено')
#
# # print('Первое включение', switch())
# switch()
# switch()
# switch()
#
# Задача 8: «Список покупок»
# Создайте глобальный пустой список shopping_list. Напишите функцию
# add_milk(), которая добавляет строку "Молоко" в этот список.
# (Подсказка: списки - это изменяемый тип данных, поэтому для метода
# .append() слово global технически не обязательно, но попробуйте понять,
# почему это работает).
# shopping_list = []
# print('Пустой список: ', shopping_list)
# def add_milk():
#     # global shopping_list
#     shopping_list.append('Молоко') # идет мутация глобальной переменной :-)
# add_milk()
# print('Заполненный список', shopping_list)

# Задача 9: «Игра: Урон по врагу»
# Создайте глобальную переменную enemy_hp = 100 Напишите функцию
# attack(). Внутри функции напишите логику: если enemy_hp больше 0,
# уменьшить его на 20 Используйте global. Вызовите функцию 6 раз и
# посмотрите, уйдет ли здоровье в минус.
# enemy_hp = 100
# print('Ваше здоровье = ', enemy_hp)
# def attack():
#     global enemy_hp
#     if enemy_hp > 0:
#         enemy_hp -= 20
#         print('Здоровье уменьшено и = ', enemy_hp)
#     else:
#         print('У вас больше нет здоровья = ', enemy_hp)
# attack()
# attack()
# attack()
# attack()
# attack()
# attack()

# Задача 10: «Система уведомлений»
# Создайте глобальную переменную notifications_count = 0 Напишите
# функцию send_alert(), которая увеличивает счетчик. Внутри этой же функции
# напишите print, который сообщает: «У вас есть
# уведомления!». Вызовите функцию внутри цикла for i in range(5).
notifications_count = 0
def send_alert():
    global notifications_count
    notifications_count += 1
    print('У вас есть уведомления!')
for i in range(7):
    send_alert()
print('Всего уведомлений: ', notifications_count)

