# Задача 1: Создайте глобальную переменную name. Напишите функцию,
# которая просто выводит это имя на экран.
# name = "Mikhail", "Arman"
# def all_names():
#     print(name)
# all_names()

# Задача 2: Внутри функции создайте переменную secret = "Пароль123".
# Попробуйте вывести её на экран вне функции
# def passw():
#     secret = 'Пароль123'
#     print(secret)
# print(passw)
#
# Задача 3: Создайте глобальную переменную balance = 1000. Напишите
# функцию, которая прибавляет к этому балансу 500, используя ключевое слово global
# balance = 1000
# def deposit():
#     global balance
#     balance += 500
#     print(balance)
# deposit()
#
# Задача 4: Напишите функцию, которая принимает один аргумент (число) и
# выводит его квадрат. Будет ли этот аргумент доступен вне функции?
# def kvadrat():
#     n = int(input('Введи число: '))
#     print(n**2)
# kvadrat() # не совсем верное решение. Ниже как надо
#
# def kvadrat2(n):
#     print(n ** 2)
# kvadrat2(8)       # 64
# kvadrat2(15)      # 225
#
# # или
# def kvadrat3(n):
#     print(n ** 2)
# n = int(input("Введи число: "))
# kvadrat3(n)

# Задача 7: Напишите программу, где есть глобальная переменная limit =
# 100. Создайте функцию, которая проверяет, больше ли переданное ей
# число, чем limit.
limit = 100
print('Начальная сумма: ', limit)

def proverka():
    global limit
    limit += 30
    if limit > 200:
        print('Передано большее, чем начальная сумма', limit)
        limit -= 200
        print('Отнимаем оп 200', limit)
    else:
        print('После каждого добавления: ', limit)

for i in range(15):
    proverka()