#
#     # Задача 1: Счётчик старта ракеты
#     print("\nЗадача 1: Счётчик ракеты")
#     n = int(input("Введите стартовое число: "))
#     while n > 0:  # пока n > 0
#         print(n)
#         n -= 1  # уменьшаем на 1
#     print("Старт!")  # выводим ТОЛЬКО ОДИН РАЗ, после цикла!

#
#
#     # Задача 2: Копилка "Мечта"
#     print("\nЗадача 2: Копилка «Мечта»")
#     target = 500000
#     itog = 0  # накопленная сумма
#     vklad = 0  # количество пополнений
#     while itog < target:
#         money = int(input("Сколько денег положить в копилку? "))
#         itog += money
#         vklad += 1
#         print(f"Текущая сумма: {itog} тг")
#     print(f"Цель достигнута! Накоплено: {itog} тг")
#     print(f"Пополняли копилку {vklad} раз(а)")
# # цикл остановиться как только itog станет больше или равно target
#
#
#
#     # Задача 3: Игра "Угадай пароль" (с break)
#     # Секретный пароль — 42.
#
#     print('\nЗадача 3: Угадай пароль')
#     password = 42
#     while True:
#         num = int(input('Введите пароль: '))
#         if num == password:
#             print('Доступ разрешен')
#             break
#
#     # Задача 4: Уборка этажей в отеле (с continue)
#     # Вам нужно убрать этажи с 1 по 10. Однако, в отеле нет 4-го этажа
#     # (суеверие). Используйте цикл while для перебора этажей. Если текущий
#     # этаж равен 4, используйте оператор continue, чтобы пропустить его
#     # обработку и перейти к следующему этажу. Для остальных этажей выводите: "Убираем этаж N...".
#     # Требует: Управление счетчиком, if для проверки условия, оператор continue
#
#     print('\nЗадача 4: Уборка этажей в отеле')
#     floor = 1
#     while floor <= 10:
#         if floor == 4:
#             print('4 этаж в соседнем доме')
#         if floor == 4:
#             floor += 1
#             continue
#         print('Убираем этаж', {floor})
#         floor += 1
#
#     # Задача 5: Калькулятор с остановкой (с break)
#     # Напишите программу, которая в цикле while true запрашивает у
#     # пользователя два числа и выводит их сумму. Если в качестве первого числа
#     # пользователь введет 0, используйте оператор break для завершения работы
#     # калькулятора. В конце выведите: "Калькулятор выключен.".
#     # Требует: while True, break, обработка нескольких переменных ввода.

# print('\nЗадача 5: Калькулятор с остановкой')
#
# while True:
#     n1 = int(input('введите первое число: '))
#     if n1 ==0:
#         print("Калькулятор выключен.")
#         break
#     n2 = int(input('введите второе число: '))
#     print(f'сумма чисел', n1 + n2, '           >>>>>>Батарейка села, до свидания!')
#     break


# Задача 6: Поиск сокровища (с else)
# Игрок ищет сундук с сокровищами в локациях с 1 по 5. Напишите цикл
# while, который проверяет локации. Сокровища нет. Позвольте циклу
# завершиться штатно (потому что локации закончились). Используйте
# конструкцию else для вывода сообщения: "Сокровище не найдено. Проверены все локации.".
# Требует: Базовый while, управление счетчиком, конструкция while...else.
#
# print('\nЗадача 6: Поиск сокровища ')
# local =1
# while local <= 5:
#     print('Ищем сокровище в локации', local)
#     local += 1
# else:
#     print('Тут ничего не найдено')

# #Задача 7: Проверка корректного ввода даты (с else и break) 📅
# Запросите у пользователя год. Цикл должен продолжаться, пока не будет
# введен год из диапазона 2000 до 2025. Используйте break для выхода, как
# только будет введен корректный год. Если цикл завершится штатно (то есть, условие while станет ложным, что маловероятно, если не
# использовать while True), выведите сообщение из блока else: "Попытки исчерпаны.".
# Требует: while True, комбинация break и else для проверки ввода, логические операторы

print('\nЗадача 7: Проверка корректного ввода даты')
while True:
    year = int(input('Введите любой год в периоде 2000-2025 года: '))
    if 2000 <= year <= 2025:
        print('Этот', year, 'год был интересным!')
        break
    else:
        print('Читай задание по буквам и цифрам')

#Тяжелый Уровень (Фокус на математической логике и сложной структуре)
# Задача 8: Проверка простого числа (с break) 🌟
# Напишите программу, которая запрашивает число N и проверяет, является
# ли оно простым (делится только на 1 и на само себя). Используйте цикл while для проверки делителей от 2 до N-1.
# Если найден делитель, используйте break для немедленного выхода, так как число уже точно не простое.
# В конце выведите результат.
# Требует: Математическая логика, while, оператор break, логика флага-переключателя.

# print('Задача 8: Проверка простого числа')
# n = int(input('Введите целое число n: '))
# while True:
#     if n % 2 == 0:
#         n //= 2
#         break
#     print('Вы ввели правильно простое число', {n})